driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/ProdMngmntSamples/CreditApplicationProcessorApplication/src/jbiasa/CreditProcessor.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<definitions name="CreditProcessor" 
             targetNamespace="http://j2ee.netbeans.org/wsdl/CreditProcessor"
             xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema" 
             xmlns:plink="http://docs.oasis-open.org/wsbpel/2.0/plnktype" 
             xmlns:tns="http://j2ee.netbeans.org/wsdl/CreditProcessor" 
             xmlns:ns3="http://approver.fs.com/" xmlns:ns="http://xml.netbeans.org/schema/CreditProcessor">    
    <types>
        <xsd:schema targetNamespace="http://j2ee.netbeans.org/wsdl/CreditProcessor">
            <xsd:import schemaLocation="CreditProcessor.xsd" namespace="http://xml.netbeans.org/schema/CreditProcessor"/>
        </xsd:schema>
    </types>
    <message name="CreditProcessorOperationRequest">
        <part name="requestMessage" element="ns:CreditApplication"/>
    </message>
    <message name="CreditProcessorOperationReply">
        <part name="responseMessage" element="ns:Decision"/>
    </message>
    <portType name="CreditProcessorPortType">
        <operation name="submitCreditApplication">
            <input name="inputRequest" message="tns:CreditProcessorOperationRequest"/>
            <output name="outputResponse" message="tns:CreditProcessorOperationReply"/>
        </operation>
    </portType>
    <binding name="CreditProcessorBinding" type="tns:CreditProcessorPortType">
        <soap:binding transport="http://schemas.xmlsoap.org/soap/http" style="document"/>
        <operation name="submitCreditApplication">
            <input name="inputRequest">
                <soap:body use="literal"/>
            </input>
            <output name="outputResponse">
                <soap:body use="literal"/>
            </output>
        </operation>
    </binding>
    <service name="CreditApplicationServer">
        <port name="CreditApplicationPort" binding="tns:CreditProcessorBinding">
            <soap:address location="http://localhost:${HttpDefaultPort}/CreditApplicationProcessorBusinessProcess/CreditProcessor/CreditApplicationPort"/>
        </port>
    </service>
    <plink:partnerLinkType name="CreditProcessorPartner">
        <!-- partnerLinkType are automatically generated when a new portType is added. partnerLinkType are used by BPEL processes. 
In a BPEL process, a partner link represents the interaction between the BPEL process and a partner service. Each partner link is associated with a partner link type.
A partner link type characterizes the conversational relationship between two services. The partner link type can have one or two roles.-->
        <plink:role name="CreditProcessorPortTypeRole" portType="tns:CreditProcessorPortType"/>
    </plink:partnerLinkType>
</definitions>
