driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/ProdMngmntSamples/CreditApplicationProcessorApplication/test/CreditProcess/Output.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns0="http://xml.netbeans.org/schema/CreditProcessor" xmlns="http://xml.netbeans.org/schema/CreditProcessor">
<SOAP-ENV:Header/>
<SOAP-ENV:Body>
  <Decision xmlns="http://xml.netbeans.org/schema/CreditProcessor">
    <ns0:decisionMessage xmlns:ns0="http://xml.netbeans.org/schema/CreditProcessor">approved</ns0:decisionMessage>
  </Decision>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
