driver-tests/bpelse/JavaEEIntegration/JavaEEToBP/ProdMngmntSamples/CreditApplicationProcessorApplication/test/CreditProcess/Input.xml

<soapenv:Envelope xsi:schemaLocation="http://schemas.xmlsoap.org/soap/envelope/ http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cred="http://xml.netbeans.org/schema/CreditProcessor">
  <soapenv:Body>
    <cred:CreditApplication>
      <cred:socialSecurityNumber>123-45-6789</cred:socialSecurityNumber>
      <cred:fistName>Johnny</cred:fistName>
      <cred:lastName>Doe</cred:lastName>
      <cred:vehicleIdentificationNumber>qyqeyquy81373wuyeuwy</cred:vehicleIdentificationNumber>
      <cred:make>BMW</cred:make>
      <cred:model>523</cred:model>
      <cred:year>2007</cred:year>
      <cred:amount>45000</cred:amount>
    </cred:CreditApplication>
  </soapenv:Body>
</soapenv:Envelope>